




CREATE OR REPLACE FUNCTION sfipxb36k15r01 () RETURNS integer AS $body$
DECLARE

--*
-- * 著作権:Copyright(c)2016
-- * 会社名:JIP
-- *
-- * 概  要:週初で受信する店舗属性情報ファイルの取込処理を実行する日かチェックする。
-- *
-- * @author 横尾 隆児
-- * @version $Id:$
-- *
-- * @param （なし）
-- * @return INTEGER 0:週初である、 1:週初でない、99:異常終了
-- *
-- ***************************************************************************
-- * ログ:
-- *    日付    開発者名		目的
-- * -------------------------------------------------------------------------
-- * 2017.02.07 横尾			新規作成
-- ***************************************************************************
--
	--==============================================================================
	--					定数定義													
	--==============================================================================
	-- ファンクションＩＤ
	C_FUNCTION_ID			CONSTANT	varchar(50)	:= 'SFIPXB36K15R01';
	-- 週初フラグ定数
	C_FLG_WEEKHEAD_NON		CONSTANT	numeric(1)	:= 0;		-- 週初フラグ 週初でない
	--==============================================================================
	--					変数定義													
	--==============================================================================
	gWeekHeadFlg			numeric(1)					:= 0;		-- 週初フラグ
	gZenkaiSunDate			char(4)							:= ' ';	-- 業務日付の前回日曜日の月日
	gKijunYmd				char(8)							:= ' ';	-- 基準日（業務日付の翌日）
	--==============================================================================
	--					例外定義													
	--==============================================================================
	--==============================================================================
	--					カーソル定義												
	--==============================================================================
--==============================================================================
--					関数定義													
--==============================================================================
--==============================================================================
--					メイン処理													
--==============================================================================
BEGIN
	CALL pkLog.debug('BATCH', C_FUNCTION_ID, '***** ' || C_FUNCTION_ID || ' START *****');
	-- 基準日の取得 
	gKijunYmd := pkDate.getPlusDateBusiness(pkDate.getGyomuYmd(), 1);
	-- 共通関数・週初チェック処理関数で業務日付が週初かチェック 
	gWeekHeadFlg := pkDate.getShushoHantei(gKijunYmd, pkconstant.TOKYO_AREA_CD);
	CALL pkLog.debug('BATCH', C_FUNCTION_ID, '***** ' || C_FUNCTION_ID || ' END *****');
	RETURN gWeekHeadFlg;
-- 例外処理
EXCEPTION
	WHEN OTHERS THEN
		CALL pkLog.fatal('ECM701', C_FUNCTION_ID, 'SQLCODE:' || SQLSTATE);
		CALL pkLog.fatal('ECM701', C_FUNCTION_ID, 'SQLERRM:' || SQLERRM);
		RETURN pkconstant.FATAL();
END;
$body$
LANGUAGE PLPGSQL
;
-- REVOKE ALL ON FUNCTION sfipxb36k15r01 () FROM PUBLIC;